[{"source": "mandate_rules.txt", "text": "Overview\nOnce a user's loan is approved, a mandate setup is required before any funds are disbursed. This section describes the loan selection process, mandate requirements, and legal responsibilities involved in repayment through automatic deductions.\n\nWorkflow\nLoan Application Interface\n\nUsers can"}, {"source": "mandate_rules.txt", "text": " apply for loans through multiple banks integrated into Autonance.\n\nLoan-type-specific filters help users select the most suitable option based on:\n\nType: Home Loan, Personal Loan, Car Loan, etc.\n\nThis allows for a more personalized loan discovery experience.\n\nLoan Application and Bank Review\n\nOnce "}, {"source": "mandate_rules.txt", "text": "the user submits the application:\n\nThe respective bank receives and begins verifying the request.\n\nThis verification process takes approximately 3–4 business days.\n\nLoan Approval\n\nUpon approval, the user is notified via the Autonance dashboard and email.\n\nAt this stage, the loan is not yet disbursed"}, {"source": "mandate_rules.txt", "text": ".\n\nThe user must proceed to set up a mandate.\n\nMandate Setup (Mandatory Before Disbursal)\n\nThe user provides bank details for EMI deduction:\n\nThis bank may be the same or different from the loan-issuing bank.\n\nDetails must be accurate and verifiable.\n\nThe user selects a mandate start date for EMI de"}, {"source": "mandate_rules.txt", "text": "duction.\n\nThis mandate authorizes the selected bank to auto-debit EMIs on the agreed schedule.\n\nMandate Verification\n\nThe bank verifies the mandate via secure channels (e.g., NACH, eSign, bank APIs).\n\nOnly after successful mandate verification, the loan amount is credited to the user’s bank account."}, {"source": "mandate_rules.txt", "text": "\n\nEMI and Legal Policy\n\nEMI will be auto-deducted from the user’s account monthly starting from the selected date.\n\nIf there is insufficient balance:\n\nA warning is issued to the user.\n\nRepeated failures (e.g., 3 warnings) will allow the bank to:\n\nTake legal action\n\nReport the user to credit authorit"}, {"source": "mandate_rules.txt", "text": "ies\n\nFalse Information Clause\n\nSubmitting false or misleading mandate/bank information will result in:\n\nImmediate rejection of the loan\n\nPotential legal consequences from the bank\n\nPossible blacklisting from future loans "}, {"source": "user_onboarding.txt", "text": "User Onboarding & Platform Flow\nOverview\nThis section covers the complete user journey on Autonance — from registration using Google Authentication to accessing financial services like loan applications, mandate setup, transaction monitoring, and analytics.\n\n1.⁠ ⁠Registration & KYC Verification\nUser"}, {"source": "user_onboarding.txt", "text": "s register/sign in using Google Authentication (OAuth).\n\nOn first login, users are required to:\n\nUpload PAN card\n\nUpload Aadhar card\n\nThis initiates the KYC (Know Your Customer) process.\n\nKYC verification is carried out by authorized back-office systems and typically takes 1–2 business days.\n\nUntil "}, {"source": "user_onboarding.txt", "text": "the KYC is approved, access to other features is restricted.\n\n2.⁠ ⁠Loan Application Process\nOnce KYC is verified, the user gains access to the loan application module.\n\nFeatures include:\n\nFilters based on loan type (e.g., Home, Education, Personal)\n\nAbility to browse offers from multiple partner ban"}, {"source": "user_onboarding.txt", "text": "ks\n\nAfter submitting a loan application:\n\nThe selected bank receives the applicant's details.\n\nThe bank performs its own verification and may accept or reject the application.\n\nStatus updates are visible on the user's dashboard.\n\n3.⁠ ⁠Mandate Setup & Loan Disbursement\nIf the loan is approved, the us"}, {"source": "user_onboarding.txt", "text": "er is prompted to:\n\nSet up a mandate using any of their existing bank accounts.\n\nProvide correct bank details and select a start date for EMI deductions.\n\nThe bank then verifies the submitted mandate.\n\nUpon successful mandate approval:\n\nThe loan amount is disbursed to the user's account.\n\nEMI paymen"}, {"source": "user_onboarding.txt", "text": "ts begin automatically based on the date specified in the mandate.\n\n⚠ Legal & Compliance Notes:\nAny false information (e.g., incorrect bank details) can lead to immediate rejection and legal action by the bank.\n\nIf the user's bank account lacks sufficient balance:\n\nWarning notifications are sent.\n\nA"}, {"source": "user_onboarding.txt", "text": "fter a set number of warnings, the bank has the right to pursue legal action.\n\n4.⁠ ⁠Bank Transaction & Analytics\nBeyond loans, users can:\n\nView their linked bank accounts.\n\nTrack real-time balances.\n\nAccess a transaction history.\n\nVisualize spending/income trends using graphical analytics.\nThis help"}, {"source": "user_onboarding.txt", "text": "s users monitor their financial behavior and plan better"}, {"source": "kyc_process.txt", "text": "Overview\nThe KYC (Know Your Customer) process is a mandatory step for all users of Autonance. It ensures that only verified individuals can access the platform's features, promoting security, trust, and compliance with regulatory norms.\n\nWorkflow\nUser Sign-In with Google\n\nUsers register and log in e"}, {"source": "kyc_process.txt", "text": "xclusively via Google Authentication.\n\nThis eliminates the need for password management and ensures secure login.\n\nRedirect to KYC Submission\n\nAfter the first successful login via Google, users are redirected to the KYC Submission Page.\n\nAccess to the rest of the platform is restricted until KYC is "}, {"source": "kyc_process.txt", "text": "completed and approved.\n\nDocument Upload\n\nUsers are prompted to upload the following:\n\nPAN Card\n\nAadhaar Card\n\nRequirements:\n\nAccepted formats: JPG, PNG, or PDF\n\nMaximum file size: 5 MB per document\n\nUsers must also agree to the terms and conditions regarding document verification and privacy.\n\nVeri"}, {"source": "kyc_process.txt", "text": "fication Timeline\n\nOnce documents are submitted:\n\nKYC verification takes 1–2 business days.\n\nThe status is shown as \"Pending Verification\" on the user's dashboard.\n\nDuring this period, access to other features remains blocked.\n\nKYC Outcome\n\nApproved: Users receive a confirmation message and are gran"}, {"source": "kyc_process.txt", "text": "ted full access to all platform features.\n\nRejected: Users receive a rejection message with the reason and an option to re-upload valid documents for re-verification."}]